{"class_name": "Model", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 128], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"}, "name": "input_2", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "lambda", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcxwAAAB8AGQAZACFAmQAZAGFAmYCGQBkAhQAZAEXAFMAKQNO\n6QEAAADpAAAAAKkAKQHaAXhyAwAAAHIDAAAA+jlDOi9Vc2Vycy96YW1tYy9QeWNoYXJtUHJvamVj\ndHMvQ1NFODkxX0Jpby9zdHlsZWdhbl90d28ucHnaCDxsYW1iZGE+7wAAAPMAAAAA\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 768, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_5", "inbound_nodes": [[["lambda", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "dtype": "float32", "target_shape": [4, 4, 48]}, "name": "reshape", "inbound_nodes": [[["dense_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation", "trainable": true, "dtype": "float32", "activation": "linear"}, "name": "activation", "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 64, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_7"}, "name": "input_7", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_7", "trainable": true, "dtype": "float32", "units": 48, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_7", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAwAAAAYAAABDAAAAc0AAAAB8AGQBGQBqAGQBGQB9AXwAZAEZAGoAZAIZAH0CfABk\nAxkAZABkAIUCZAB8AYUCZAB8AoUCZABkAIUCZgQZAFMAKQRO6QEAAADpAgAAAOkAAAAAKQHaBXNo\nYXBlKQPaAXjaBmhlaWdodNoFd2lkdGipAHIIAAAA+jlDOi9Vc2Vycy96YW1tYy9QeWNoYXJtUHJv\namVjdHMvQ1NFODkxX0Jpby9zdHlsZWdhbl90d28ucHnaC2Nyb3BfdG9fZml0QQAAAHMGAAAAAAIO\nAQ4C\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_1", "inbound_nodes": [[["input_7", 0, 0, {}], ["activation", 0, 0, {}]]]}, {"class_name": "Conv2DMod", "config": {"name": "conv2d_mod", "trainable": true, "dtype": "float32", "filters": 384, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": true}, "name": "conv2d_mod", "inbound_nodes": [[["activation", 0, 0, {}], ["dense_7", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_8", "trainable": true, "dtype": "float32", "units": 384, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_8", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_6", "trainable": true, "dtype": "float32"}, "name": "add_6", "inbound_nodes": [[["conv2d_mod", 0, 0, {}], ["dense_8", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_16", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_16", "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_9", "trainable": true, "dtype": "float32", "units": 384, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_9", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "Conv2DMod", "config": {"name": "conv2d_mod_1", "trainable": true, "dtype": "float32", "filters": 384, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": true}, "name": "conv2d_mod_1", "inbound_nodes": [[["leaky_re_lu_16", 0, 0, {}], ["dense_9", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_10", "trainable": true, "dtype": "float32", "units": 384, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_10", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_7", "trainable": true, "dtype": "float32"}, "name": "add_7", "inbound_nodes": [[["conv2d_mod_1", 0, 0, {}], ["dense_10", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_17", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_17", "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_3", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAABDAAAAcxQAAAB0AGoBfABkAWQBZAJkA2QEjQVTACkFTukCAAAA2g1j\naGFubmVsc19sYXN02ghiaWxpbmVhcikB2g1pbnRlcnBvbGF0aW9uKQLaAUvaDXJlc2l6ZV9pbWFn\nZXMpAdoBeKkAcggAAAD6OUM6L1VzZXJzL3phbW1jL1B5Y2hhcm1Qcm9qZWN0cy9DU0U4OTFfQmlv\nL3N0eWxlZ2FuX3R3by5wedoIdXBzYW1wbGVIAAAAcwIAAAAAAQ==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [null, 8, 8, null], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_3", "inbound_nodes": [[["leaky_re_lu_17", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 128], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_3"}, "name": "input_3", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_12", "trainable": true, "dtype": "float32", "units": 384, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_12", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_4", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAwAAAAYAAABDAAAAc0AAAAB8AGQBGQBqAGQBGQB9AXwAZAEZAGoAZAIZAH0CfABk\nAxkAZABkAIUCZAB8AYUCZAB8AoUCZABkAIUCZgQZAFMAKQRO6QEAAADpAgAAAOkAAAAAKQHaBXNo\nYXBlKQPaAXjaBmhlaWdodNoFd2lkdGipAHIIAAAA+jlDOi9Vc2Vycy96YW1tYy9QeWNoYXJtUHJv\namVjdHMvQ1NFODkxX0Jpby9zdHlsZWdhbl90d28ucHnaC2Nyb3BfdG9fZml0QQAAAHMGAAAAAAIO\nAQ4C\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_4", "inbound_nodes": [[["input_7", 0, 0, {}], ["lambda_3", 0, 0, {}]]]}, {"class_name": "Conv2DMod", "config": {"name": "conv2d_mod_3", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": true}, "name": "conv2d_mod_3", "inbound_nodes": [[["lambda_3", 0, 0, {}], ["dense_12", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_13", "trainable": true, "dtype": "float32", "units": 192, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_13", "inbound_nodes": [[["lambda_4", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_8", "trainable": true, "dtype": "float32"}, "name": "add_8", "inbound_nodes": [[["conv2d_mod_3", 0, 0, {}], ["dense_13", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_18", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_18", "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_14", "trainable": true, "dtype": "float32", "units": 192, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_14", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "Conv2DMod", "config": {"name": "conv2d_mod_4", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": true}, "name": "conv2d_mod_4", "inbound_nodes": [[["leaky_re_lu_18", 0, 0, {}], ["dense_14", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_15", "trainable": true, "dtype": "float32", "units": 192, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_15", "inbound_nodes": [[["lambda_4", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_9", "trainable": true, "dtype": "float32"}, "name": "add_9", "inbound_nodes": [[["conv2d_mod_4", 0, 0, {}], ["dense_15", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_19", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_19", "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_6", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAABDAAAAcxQAAAB0AGoBfABkAWQBZAJkA2QEjQVTACkFTukCAAAA2g1j\naGFubmVsc19sYXN02ghiaWxpbmVhcikB2g1pbnRlcnBvbGF0aW9uKQLaAUvaDXJlc2l6ZV9pbWFn\nZXMpAdoBeKkAcggAAAD6OUM6L1VzZXJzL3phbW1jL1B5Y2hhcm1Qcm9qZWN0cy9DU0U4OTFfQmlv\nL3N0eWxlZ2FuX3R3by5wedoIdXBzYW1wbGVIAAAAcwIAAAAAAQ==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [null, 16, 16, null], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_6", "inbound_nodes": [[["leaky_re_lu_19", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 128], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_4"}, "name": "input_4", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_17", "trainable": true, "dtype": "float32", "units": 192, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_17", "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_7", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAwAAAAYAAABDAAAAc0AAAAB8AGQBGQBqAGQBGQB9AXwAZAEZAGoAZAIZAH0CfABk\nAxkAZABkAIUCZAB8AYUCZAB8AoUCZABkAIUCZgQZAFMAKQRO6QEAAADpAgAAAOkAAAAAKQHaBXNo\nYXBlKQPaAXjaBmhlaWdodNoFd2lkdGipAHIIAAAA+jlDOi9Vc2Vycy96YW1tYy9QeWNoYXJtUHJv\namVjdHMvQ1NFODkxX0Jpby9zdHlsZWdhbl90d28ucHnaC2Nyb3BfdG9fZml0QQAAAHMGAAAAAAIO\nAQ4C\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_7", "inbound_nodes": [[["input_7", 0, 0, {}], ["lambda_6", 0, 0, {}]]]}, {"class_name": "Conv2DMod", "config": {"name": "conv2d_mod_6", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": true}, "name": "conv2d_mod_6", "inbound_nodes": [[["lambda_6", 0, 0, {}], ["dense_17", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_18", "trainable": true, "dtype": "float32", "units": 96, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_18", "inbound_nodes": [[["lambda_7", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_10", "trainable": true, "dtype": "float32"}, "name": "add_10", "inbound_nodes": [[["conv2d_mod_6", 0, 0, {}], ["dense_18", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_20", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_20", "inbound_nodes": [[["add_10", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_19", "trainable": true, "dtype": "float32", "units": 96, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_19", "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"class_name": "Conv2DMod", "config": {"name": "conv2d_mod_7", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": true}, "name": "conv2d_mod_7", "inbound_nodes": [[["leaky_re_lu_20", 0, 0, {}], ["dense_19", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_20", "trainable": true, "dtype": "float32", "units": 96, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_20", "inbound_nodes": [[["lambda_7", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_11", "trainable": true, "dtype": "float32"}, "name": "add_11", "inbound_nodes": [[["conv2d_mod_7", 0, 0, {}], ["dense_20", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_21", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_21", "inbound_nodes": [[["add_11", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_9", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAABDAAAAcxQAAAB0AGoBfABkAWQBZAJkA2QEjQVTACkFTukCAAAA2g1j\naGFubmVsc19sYXN02ghiaWxpbmVhcikB2g1pbnRlcnBvbGF0aW9uKQLaAUvaDXJlc2l6ZV9pbWFn\nZXMpAdoBeKkAcggAAAD6OUM6L1VzZXJzL3phbW1jL1B5Y2hhcm1Qcm9qZWN0cy9DU0U4OTFfQmlv\nL3N0eWxlZ2FuX3R3by5wedoIdXBzYW1wbGVIAAAAcwIAAAAAAQ==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [null, 32, 32, null], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_9", "inbound_nodes": [[["leaky_re_lu_21", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 128], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_5"}, "name": "input_5", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_22", "trainable": true, "dtype": "float32", "units": 96, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_22", "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_10", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAwAAAAYAAABDAAAAc0AAAAB8AGQBGQBqAGQBGQB9AXwAZAEZAGoAZAIZAH0CfABk\nAxkAZABkAIUCZAB8AYUCZAB8AoUCZABkAIUCZgQZAFMAKQRO6QEAAADpAgAAAOkAAAAAKQHaBXNo\nYXBlKQPaAXjaBmhlaWdodNoFd2lkdGipAHIIAAAA+jlDOi9Vc2Vycy96YW1tYy9QeWNoYXJtUHJv\namVjdHMvQ1NFODkxX0Jpby9zdHlsZWdhbl90d28ucHnaC2Nyb3BfdG9fZml0QQAAAHMGAAAAAAIO\nAQ4C\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_10", "inbound_nodes": [[["input_7", 0, 0, {}], ["lambda_9", 0, 0, {}]]]}, {"class_name": "Conv2DMod", "config": {"name": "conv2d_mod_9", "trainable": true, "dtype": "float32", "filters": 72, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": true}, "name": "conv2d_mod_9", "inbound_nodes": [[["lambda_9", 0, 0, {}], ["dense_22", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_23", "trainable": true, "dtype": "float32", "units": 72, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_23", "inbound_nodes": [[["lambda_10", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_12", "trainable": true, "dtype": "float32"}, "name": "add_12", "inbound_nodes": [[["conv2d_mod_9", 0, 0, {}], ["dense_23", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_22", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_22", "inbound_nodes": [[["add_12", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_24", "trainable": true, "dtype": "float32", "units": 72, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_24", "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"class_name": "Conv2DMod", "config": {"name": "conv2d_mod_10", "trainable": true, "dtype": "float32", "filters": 72, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": true}, "name": "conv2d_mod_10", "inbound_nodes": [[["leaky_re_lu_22", 0, 0, {}], ["dense_24", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_25", "trainable": true, "dtype": "float32", "units": 72, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_25", "inbound_nodes": [[["lambda_10", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_13", "trainable": true, "dtype": "float32"}, "name": "add_13", "inbound_nodes": [[["conv2d_mod_10", 0, 0, {}], ["dense_25", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_23", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_23", "inbound_nodes": [[["add_13", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_12", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAABDAAAAcxQAAAB0AGoBfABkAWQBZAJkA2QEjQVTACkFTukCAAAA2g1j\naGFubmVsc19sYXN02ghiaWxpbmVhcikB2g1pbnRlcnBvbGF0aW9uKQLaAUvaDXJlc2l6ZV9pbWFn\nZXMpAdoBeKkAcggAAAD6OUM6L1VzZXJzL3phbW1jL1B5Y2hhcm1Qcm9qZWN0cy9DU0U4OTFfQmlv\nL3N0eWxlZ2FuX3R3by5wedoIdXBzYW1wbGVIAAAAcwIAAAAAAQ==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [null, 64, 64, null], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_12", "inbound_nodes": [[["leaky_re_lu_23", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 128], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_6"}, "name": "input_6", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_27", "trainable": true, "dtype": "float32", "units": 72, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_27", "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_13", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAwAAAAYAAABDAAAAc0AAAAB8AGQBGQBqAGQBGQB9AXwAZAEZAGoAZAIZAH0CfABk\nAxkAZABkAIUCZAB8AYUCZAB8AoUCZABkAIUCZgQZAFMAKQRO6QEAAADpAgAAAOkAAAAAKQHaBXNo\nYXBlKQPaAXjaBmhlaWdodNoFd2lkdGipAHIIAAAA+jlDOi9Vc2Vycy96YW1tYy9QeWNoYXJtUHJv\namVjdHMvQ1NFODkxX0Jpby9zdHlsZWdhbl90d28ucHnaC2Nyb3BfdG9fZml0QQAAAHMGAAAAAAIO\nAQ4C\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_13", "inbound_nodes": [[["input_7", 0, 0, {}], ["lambda_12", 0, 0, {}]]]}, {"class_name": "Conv2DMod", "config": {"name": "conv2d_mod_12", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": true}, "name": "conv2d_mod_12", "inbound_nodes": [[["lambda_12", 0, 0, {}], ["dense_27", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_28", "trainable": true, "dtype": "float32", "units": 48, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_28", "inbound_nodes": [[["lambda_13", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_14", "trainable": true, "dtype": "float32"}, "name": "add_14", "inbound_nodes": [[["conv2d_mod_12", 0, 0, {}], ["dense_28", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_24", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_24", "inbound_nodes": [[["add_14", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_29", "trainable": true, "dtype": "float32", "units": 48, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_29", "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"class_name": "Conv2DMod", "config": {"name": "conv2d_mod_13", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": true}, "name": "conv2d_mod_13", "inbound_nodes": [[["leaky_re_lu_24", 0, 0, {}], ["dense_29", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_30", "trainable": true, "dtype": "float32", "units": 48, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_30", "inbound_nodes": [[["lambda_13", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_15", "trainable": true, "dtype": "float32"}, "name": "add_15", "inbound_nodes": [[["conv2d_mod_13", 0, 0, {}], ["dense_30", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_6", "trainable": true, "dtype": "float32", "units": 384, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 50.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_6", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_11", "trainable": true, "dtype": "float32", "units": 192, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 25.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_11", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_16", "trainable": true, "dtype": "float32", "units": 96, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 12.5, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_16", "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_21", "trainable": true, "dtype": "float32", "units": 72, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 6.25, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_21", "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_25", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_25", "inbound_nodes": [[["add_15", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_26", "trainable": true, "dtype": "float32", "units": 48, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 3.125, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_26", "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"class_name": "Conv2DMod", "config": {"name": "conv2d_mod_2", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 50.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": false}, "name": "conv2d_mod_2", "inbound_nodes": [[["leaky_re_lu_17", 0, 0, {}], ["dense_6", 0, 0, {}]]]}, {"class_name": "Conv2DMod", "config": {"name": "conv2d_mod_5", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 25.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": false}, "name": "conv2d_mod_5", "inbound_nodes": [[["leaky_re_lu_19", 0, 0, {}], ["dense_11", 0, 0, {}]]]}, {"class_name": "Conv2DMod", "config": {"name": "conv2d_mod_8", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 12.5, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": false}, "name": "conv2d_mod_8", "inbound_nodes": [[["leaky_re_lu_21", 0, 0, {}], ["dense_16", 0, 0, {}]]]}, {"class_name": "Conv2DMod", "config": {"name": "conv2d_mod_11", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 6.25, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": false}, "name": "conv2d_mod_11", "inbound_nodes": [[["leaky_re_lu_23", 0, 0, {}], ["dense_21", 0, 0, {}]]]}, {"class_name": "Conv2DMod", "config": {"name": "conv2d_mod_14", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 3.125, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": false}, "name": "conv2d_mod_14", "inbound_nodes": [[["leaky_re_lu_25", 0, 0, {}], ["dense_26", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAcAAABDAAAAcy4AAAB0AHwAagFkARkAGwB9AXQCagN8AHQEfAGDAXQEfAGD\nAWQCZANkBI0FfQB8AFMAKQVO6QIAAADaDWNoYW5uZWxzX2xhc3TaCGJpbGluZWFyKQHaDWludGVy\ncG9sYXRpb24pBdoHaW1fc2l6ZdoFc2hhcGXaAUvaDXJlc2l6ZV9pbWFnZXPaA2ludCkC2gF42gF5\nqQByDAAAAPo5QzovVXNlcnMvemFtbWMvUHljaGFybVByb2plY3RzL0NTRTg5MV9CaW8vc3R5bGVn\nYW5fdHdvLnB52hB1cHNhbXBsZV90b19zaXplSwAAAHMGAAAAAAEOARwB\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [null, 64, 64, null], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_2", "inbound_nodes": [[["conv2d_mod_2", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_5", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAcAAABDAAAAcy4AAAB0AHwAagFkARkAGwB9AXQCagN8AHQEfAGDAXQEfAGD\nAWQCZANkBI0FfQB8AFMAKQVO6QIAAADaDWNoYW5uZWxzX2xhc3TaCGJpbGluZWFyKQHaDWludGVy\ncG9sYXRpb24pBdoHaW1fc2l6ZdoFc2hhcGXaAUvaDXJlc2l6ZV9pbWFnZXPaA2ludCkC2gF42gF5\nqQByDAAAAPo5QzovVXNlcnMvemFtbWMvUHljaGFybVByb2plY3RzL0NTRTg5MV9CaW8vc3R5bGVn\nYW5fdHdvLnB52hB1cHNhbXBsZV90b19zaXplSwAAAHMGAAAAAAEOARwB\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [null, 64, 64, null], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_5", "inbound_nodes": [[["conv2d_mod_5", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_8", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAcAAABDAAAAcy4AAAB0AHwAagFkARkAGwB9AXQCagN8AHQEfAGDAXQEfAGD\nAWQCZANkBI0FfQB8AFMAKQVO6QIAAADaDWNoYW5uZWxzX2xhc3TaCGJpbGluZWFyKQHaDWludGVy\ncG9sYXRpb24pBdoHaW1fc2l6ZdoFc2hhcGXaAUvaDXJlc2l6ZV9pbWFnZXPaA2ludCkC2gF42gF5\nqQByDAAAAPo5QzovVXNlcnMvemFtbWMvUHljaGFybVByb2plY3RzL0NTRTg5MV9CaW8vc3R5bGVn\nYW5fdHdvLnB52hB1cHNhbXBsZV90b19zaXplSwAAAHMGAAAAAAEOARwB\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [null, 64, 64, null], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_8", "inbound_nodes": [[["conv2d_mod_8", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_11", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAcAAABDAAAAcy4AAAB0AHwAagFkARkAGwB9AXQCagN8AHQEfAGDAXQEfAGD\nAWQCZANkBI0FfQB8AFMAKQVO6QIAAADaDWNoYW5uZWxzX2xhc3TaCGJpbGluZWFyKQHaDWludGVy\ncG9sYXRpb24pBdoHaW1fc2l6ZdoFc2hhcGXaAUvaDXJlc2l6ZV9pbWFnZXPaA2ludCkC2gF42gF5\nqQByDAAAAPo5QzovVXNlcnMvemFtbWMvUHljaGFybVByb2plY3RzL0NTRTg5MV9CaW8vc3R5bGVn\nYW5fdHdvLnB52hB1cHNhbXBsZV90b19zaXplSwAAAHMGAAAAAAEOARwB\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [null, 64, 64, null], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_11", "inbound_nodes": [[["conv2d_mod_11", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_14", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAcAAABDAAAAcy4AAAB0AHwAagFkARkAGwB9AXQCagN8AHQEfAGDAXQEfAGD\nAWQCZANkBI0FfQB8AFMAKQVO6QIAAADaDWNoYW5uZWxzX2xhc3TaCGJpbGluZWFyKQHaDWludGVy\ncG9sYXRpb24pBdoHaW1fc2l6ZdoFc2hhcGXaAUvaDXJlc2l6ZV9pbWFnZXPaA2ludCkC2gF42gF5\nqQByDAAAAPo5QzovVXNlcnMvemFtbWMvUHljaGFybVByb2plY3RzL0NTRTg5MV9CaW8vc3R5bGVn\nYW5fdHdvLnB52hB1cHNhbXBsZV90b19zaXplSwAAAHMGAAAAAAEOARwB\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [null, 64, 64, null], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_14", "inbound_nodes": [[["conv2d_mod_14", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_16", "trainable": true, "dtype": "float32"}, "name": "add_16", "inbound_nodes": [[["lambda_2", 0, 0, {}], ["lambda_5", 0, 0, {}], ["lambda_8", 0, 0, {}], ["lambda_11", 0, 0, {}], ["lambda_14", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_15", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAIAAABTAAAAcwwAAAB8AGQBGwBkAhcAUwApA07pAgAAAGcAAAAAAADgP6kA\nKQHaAXlyAgAAAHICAAAA+jlDOi9Vc2Vycy96YW1tYy9QeWNoYXJtUHJvamVjdHMvQ1NFODkxX0Jp\nby9zdHlsZWdhbl90d28ucHnaCDxsYW1iZGE+DgEAAPMAAAAA\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_15", "inbound_nodes": [[["add_16", 0, 0, {}]]]}], "input_layers": [["input_2", 0, 0], ["input_3", 0, 0], ["input_4", 0, 0], ["input_5", 0, 0], ["input_6", 0, 0], ["input_7", 0, 0]], "output_layers": [["lambda_15", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}